app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all.sort_by do |task|
---
SELECT "tasks".* FROM "tasks"

  def show
    task_id = params[:id]
    @task = Task.find_by(id: task_id)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

    task = Task.new(
      task_params
    )

    if task.save
---
INSERT INTO "tasks" ("action", "description", "created_at", "updated_at", "completion_date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["action", "Do nothing"], ["description", "nothing!!!!!!!!"], ["created_at", "2018-09-19 22:34:14.451240"], ["updated_at", "2018-09-19 22:34:14.451240"], ["completion_date", "2018-09-20"]]

  def update
    @task = Task.find_by(id: params[:id])

    if @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "replace bad coffee"], ["updated_at", "2018-09-20 20:01:20.756144"], ["id", 6]]

  def destroy
    Task.find_by(id: params[:id]).destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 9]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def complete
    @task = Task.find(params[:id])
    if @task.update_attributes(:mark_complete => !@task.mark_complete, :completion_date => (@task.mark_complete ? nil : Date.today))
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "tasks" SET "mark_complete" = $1, "completion_date" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["mark_complete", true], ["completion_date", "2018-09-22"], ["updated_at", "2018-09-22 17:59:52.992801"], ["id", 16]]